print('Шляпка гриба, покрытая … кожиц..й, держится на … ножк.. . Снизу шляпка затянута … плёнкой. Когда её уберёшь, откроется нижняя … сторона шляпк.. .')

a = input('введите недостоющее первое слово (покрытая ...): ')
b = input('введите недостающую первую букву (кожиц..й ): ')
с = input('введите недостоющее слово (на … ): ')
d = input('введите недостоющую букву (ножк.. ): ')
e = input('введите недостоющую букву (затянута … ): ')
f = input('введите недостоющую букву (нижняя … ): ')
g = input('введите недостоющую букву (шляпк.. ): ')

print(f'Шляпка гриба, покрытая {a} кожица {b} й, держится на {c} ножк {d} . Снизу шляпка затянута {e} плёнкой. Когда её уберёшь, откроется нижняя {f} сторона шляпк {g} .')
